[{"name": "projects/talent-cloud-jobs-prod/jobs/142966491981980358", "link": "https://jobs.parsons.com/job/13961518/designer-supervisor-richardson-tx/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Ready to put your skills to work on Technical or Engineering projects? Are you great with people and have willingness to work hard to get the job done? Parsons is seeking a candidate with a desire to enhance the fabric of our community.Role:Supervises all discipline design/drafting personnel on the larger and more-complex projects. Group size is typically more than 10 employees. Draws upon extensive experience, particularly with typical engineering/construction projects.Responsibilities:Defines discipline design organization and participation on a project, including execution of discipline work involving design approach, schedules, standards, budgets, and procedures to meet client scope of work requirements.Makes staffing assignments and monitors productivity and technical proficiency of the assigned personnel. Reviews work produced to ensure that applicable codes, standards, and procedures are followed, and that quality is acceptable. Provides training and development, conducts performance evaluations, and takes corrective action as necessary. May make recommendations for salary increases and/or promotions.Advises engineering and project management regarding any problem areas, staffing requirements, progress slippage, scope changes, budget overruns, or other events which could negatively affect project completion and/or profitability.Serves as Job Leader, with responsibility for preliminary through final project completion, including liaison with clients, suppliers, and contractors.Provides design direction, making decisions and/or obtaining technical staff assistance when necessary. Recommends design methods and equipment use for discipline standards. Oversees application of state-of-the-art technology in the design area and recommends improvements to production methods. Responsible for the progress and quality of drawings produced by those supervised.Ensures that checking is performed in accordance with discipline checking policy and procedures.Coordinates discipline design work with project staff and other engineering disciplines.Initiates and/or reviews change order requests for additions, deletions, or changes to the original scope of work.Actively participates in the company Quality Improvement Process (QIP).Performs other responsibilities associated with this position as may be appropriate.Qualifications:2-year technical degree or certificate of completion in CAD design from an accredited technical institution (or equivalent) is preferred, and typically 12+ years of related experience (including supervisory experience).Requirements include strong PC and CAD skills, as well as knowledge of the capabilities and efficiencies of utilizing specific computer software to complete design assignments. Also requires excellent written and oral communications skills, and the proven ability for performing in a supervisory capacity on a project."}, {"name": "projects/talent-cloud-jobs-prod/jobs/96014596696875718", "link": "https://jobs.parsons.com/job/13961517/construction-manager-washington-dc/", "job_info": "Minimum Clearance Required to Start:Department of Energy (DOE-Q)Job Description:Ready to take your construction experience to the next level to work on complex facility upgrades that will have a huge impact? Parsons is now hiring a Construction Manager who can work as an integrated team member and trusted agent supporting the Department of Energy (DOE) in a secure space renovation project at DOE's headquarters building. Parsons’ extensive experience in this field, combined with your proven knowledge of construction policies and procedures, will propel your career forward with opportunity for advancement with top performance.  We need our Construction Managers to be versatile, experienced leading teams, and exceptional at communication, analysis, and management. In this role, you will be responsible for working as a member of an integrated team and, as a trusted agent, the owner’s representative to help the owner bring together a multi-disciplined team of individuals whose qualifications and experience meet the expertise required to accomplish the assigned construction management tasks.  Responsibilities:The Construction Manager will work on behalf of the client with responsibilities including:Ensure construction contractors and associated construction activities adhere to DOE and specific contract requirements.Understand inherently governmental function as it applies to construction contracts.Coordinate contractor’s construction work plan with site facility manager.Collaborate with the owner, contracts personnel, construction contractor, engineers, architects, end user, and landowner to discuss and resolve matters such as work procedures, complaints, and construction problemsInspect and review project to monitor compliance with building and safety codes, contract documents, standard trade practices, and other regulations.Ensure construction progresses safely and conforms to approved Safety Plan and associated Work Control Permits.Monitor construction site to ensure the contractor is keeping the site orderly and active program office areas are accessible.Perform daily site visits to review the work progress.  Monitors daytime and off-hour construction activities.  Individual is onsite during critical construction activities such as during utility outages.Generate construction progress photos and updates and keeps photo index and database current.Provide daily construction activity reports to the client for the construction contract.Perform inspections at work site.Review contractor's construction schedules (monthly and 2 week look ahead), advising owner of potential conflicts and delays.Prepare and lead weekly and monthly meeting with DOE Senior Staff.Review contractor pay request and provide recommendations to owner.Assist in resolving any scheduled safety inspections and deficiencies. Function as a Government witness when required by construction contract.Ensure administrative and facility related coordination efforts such as trash removal, material deliveries, complaint resolutions, and utility outages (fire protection, electrical, mechanical systems).   Qualifications:  Bachelor's degree in Civil Engineering or a construction related field15+ years of construction management experience with related projectsDOE \"Q\" or DOD \"TS\" clearance is required to start.Experience in occupied facilities, office building renovations, or secure area upgrades a plusPrior experience in overseeing and managing the construction of major capital improvement projectsOther Requirements:  Candidate must be able to pass a pre-employment drug screening and background/references checkCandidate will be submitted for a DOE \"Q\" security clearance, which requires an investigation by Federal authoritiesCandidate must be a US CitizenSome off-hour work may be requiredReady for action? We’re looking for the kind of people who see this opportunity and don’t hesitate to act. Parsons is a leading solutions provider to clients all over the world. We hire people with a broad set of technical skills who have proven experience tackling some of the greatest challenges. Take your next step and apply today. Parsons Referral PlanMaybe this opportunity isn’t the right fit for you, but you know someone who is? Why not join our Parsons external referral program? When you refer other top professionals and they are hired, you are rewarded with an incredible financial incentive. Help us find top talent! Must be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/109843154439414470", "link": "https://jobs.parsons.com/job/13961516/sca-electrician-maint-fort-walton-beach-fl/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:If you are an electrician looking to join team and jump start your career, Parsons may be the place for you! We are currently seeking a maintenance electrician to support our efforts. It’s time to make your skills as an electrician work for you!  Qualifications:6+ years of experience in the electrical construction industryConstruction, safety, and quality training/certifications a plusMS Office experience and computer proficiency requiredMust be able to repetitively lift up to 50 poundsMust be willing to travel 100% throughout the United States and its territoriesMust be willing to work overtime when requiredValid driver license and ability to pass a motor vehicle record check requiredMust have, or be able to obtain, a satisfactory DOT medical examinationMust be able to pass a preemployment drug testMust be able to meet customer security requirements (moderate to high risk)"}, {"name": "projects/talent-cloud-jobs-prod/jobs/128008186041901766", "link": "https://jobs.parsons.com/job/13961515/project-engineer-roads-and-highways-markham-ca/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Ready to put your project engineer expertise to work on marquee projects that will change the fabric of our communities? Would you enjoy being involved on a wide variety of engineering tasks on large scale, complex projects? Parsons is now hiring a Project Engineer for our roads and highways portfolio of projects. Parsons extensive experience in this field, combined with your advanced project and engineering knowledge, will propel your career forward with opportunity to lead teams.  We need our engineers to be versatile, enthusiastic to work in highly flexible, team oriented environment and who have exceptional communication, analytical and leadership skills.   In this role you will integrate the various engineering, scheduling, procurement, construction, and startup aspects of a small project.  May manage a subtask of a larger project or study in accordance with contractual obligations.  Responsible for the technical excellence of the engineering functions of the project including coordination of technical disciplines, procurement of materials and equipment, and construction planning assistance. Responsibilities:Develops the scope of engineering work, schedules, and budgets for assigned project elements, and monitors progress to meet schedule and budget requirements. Identifies and documents changes in scope. Assists in determining the scope of procurement work, schedules, and budgets for assigned project buy outs, monitoring progress to maintain those procurements. Interfaces with procurement and subcontract personnel to facilitate the bid process. Coordinates the utilization of interdisciplinary technical personnel on the project with other Project Engineers.  Coordinates the assignment of personnel from other technical support groups within the company.Assists the Project Manager in planning, directing, supervising, and controlling the execution of technical, fiscal, and administrative functions of the project or study. Assists in determining the technical skills and staff hours required for successful completion of the project.Ensures client criteria and scope are met by all engineering disciplines. Expedites distribution of action items following discussions/meetings with the client and Project Manager.Prepares technical reports and documentation of activity for the client and project management.Obtains, analyzes, and circulates technical and contractual information to project disciplines.Performs other responsibilities associated with this position as may be appropriate.Qualifications:Bachelor's degree in Engineering10+ years of related roads and highways engineering experience, or a broad general engineering background is requiredProfessional registration with PEOPotential to perform in a lead capacity (i.e. highways lead)Excellent written and oral communications skillsFamiliarity of industry practices and regulations are requiredMust also possess a thorough knowledge of current technology and be able to select and apply appropriate engineering software for use on projectExperience on MTO projects is a must; multiple regions preferredExperience with local clients (municipalities) is a plus"}, {"name": "projects/talent-cloud-jobs-prod/jobs/130652997911749318", "link": "https://jobs.parsons.com/job/13955060/environmental-project-manager-oakville-ca/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Environmental Project Manager- Contaminated Sites Assessments and Remediation- ON CanadaFor more than 75 years, we have contributed our knowledge and skills to industrial projects around the world, helping lead the evolution of the industry. We are currently seeking qualified candidates to be part of our Industrial Market -Environmental team contributing as a Senior Project Manager in our Oakville office. The primary responsibilities for this position will include consulting, project management, coordinating investigations and investigations, and preparing reports for industrial and public sector clients.  Specific job description includes but is not limited to the following:Report and plan writing, focused on:Phase I and II Environmental Site Assessments to CSA and O.Reg.153/04 requirements;Remedial design and site remediation; including excavations, ISCO, bioremediation, permeable and impermeable barriers, and mechanical technologies (air sparge, pump and treat, dual phase extraction, etc).Designated and Hazardous Substances SurveysRoutine Soil and groundwater monitoring,Excess Soil and Waste Management.Peer review of technical documents and reports;Proposal preparation;Project Management and Coordination:ESA and remediation related projectsDesignated Substances Surveys and abatementsTracking and maintaining budgets and project finances;Preparing Reports;Maintain client relationships in various industries;Working with clients, junior staff, and other project managers.As we diversify our portfolio of environmental projects, other projects may include:Environmental management plansEnvironmental permitting and monitoring related to constructionHydrogeology Assessments: modeling and field investigationsEcological surveyingREQUIRED EDUCATION/EXPERIENCE: 8+ years of working experience in site remediation and environmental site assessmentsUniversity degree in a related field of study such as Environmental Engineering, Environmental Science, Hydrogeology or Geology;Technical expertise with environmental site assessment, remediation design, combined with a mechanical aptitude;Execution of projects with Health and Safety as the top priority;Knowledge of risk assessment risk management theory and application;Extensive working knowledge with Ontario Regulation 153/04, as amended (including filing of Record of Site Condition);Knowledge and application of excess soil regulations O.Reg. 406/19.Expertise in managing a team, budget management, report preparation, and client relationship management;Strong organizational and time management skills; andExcellent oral and written communication skills, as well as advanced technical writing abilities.PREFERRED QUALIFICATIONSP.Eng. or P.Geo. license in Ontario (or equivalent designation from another Province or the US) or eligible to obtain a license within two years of employment with Parsons;Experience in Business Development, track record in pricing and winning ESA projects.Environmental management, environmental site assessment experience in the context of infrastructure planning, pre-design, detailed design and construction projects.Experience or working knowledge of Sharepoint, including PowerApps and Power Automation toolsBroad environmental management experience related to engineering and construction would be an asset (permitting, ecological surveys, air and noise assessments, topographical surveys, water and wastewater sampling, geomorphology, etc.)"}, {"name": "projects/talent-cloud-jobs-prod/jobs/94839705171829446", "link": "https://jobs.parsons.com/job/13955059/surveillance-operations-so-specialist-fort-belvoir-va/", "job_info": "Minimum Clearance Required to Start:Top Secret SCIJob Description:Parsons Corporation is seeking candidates to join a highly successful team that has won and performed over $100 Million of Defense Threat Reduction Agency (DTRA) work around the world for more than 20 years.  This challenging and exciting work will provide you the opportunity to travel CONUS and OCONUS to the most important DoD defense systems and critical infrastructure to ensure the survivability of any threat or attack. This is an exciting opportunity to experience travelling to destinations around the world and protecting mission critical infrastructure.The Defense Threat Reduction Agency (DTRA), Nuclear Enterprise Support Directorate (NE) performs integrated, multidisciplinary, Balanced Survivability Assessments (BSAs) that assess survivability of critical U.S. and allied national/theater mission systems, networks, architectures, infrastructures, and assets.BSA teams aim to ensure continuity to DoD missions and critical infrastructure by assessing the vulnerabilities and survivability of these infrastructure against a broad spectrum of threats including accidents, natural disasters, technological failure, information system attacks, terrorists, radio frequency weapons (RFW), sabotage, and weapons of mass destruction (WMD).In order to ensure continuity of DoD Missions and to maintain continuous operations of critical infrastructure, it is imperative to have fully functional BSA teams (1) to conduct Blue Team Assessments; (2) to provide specific SME assistance to Technical Support Projects (TSPs); (3) to provide Design Review assistance; and (4) to provide technical assistance to the Home Team.   The size and skillsets of each team will vary and include those required to execute each mission.  The resource needs of each mission and/or stakeholder requests will be identified and managed by DTRA.BSA assessments include, but are not limited to, examining surveillance operations, physical security, telecommunications (e.g., video, voice and data, commercial and military), information operations (e.g., computer networks, IA tools use, operations security), structural protection and response (to include blast effects modeling and consideration of anti-terrorism/force protection standards), utility subsystems (e.g., power and heating, ventilation, and air conditioning reliability and endurance), weapons of mass destruction protection, emergency operations (e.g., emergency preparedness, fire protection, emergency response, disaster control and recovery, continuity of operations), and electromagnetic protection (e.g., electromagnetic pulse and radio frequency weapon susceptibility, lightning protection).  The BSA mission, by necessity, is fluid and requires the teams operating within these environments to be adaptable.BSA teams may be deployed to high-threat, but permissive environments anywhere in the world.The SO Specialist simulates the collection activities normally associated with a hostile agent operation in the local area. The SO is given the name of the city/base/port and a general description of the target. The SO first attempts to collect information about the target facility without the aid of assets normally available to state- sponsored foreign intelligence Entity (FIE). His or her collection activities normally begin in advance of the arrival of the rest of the BSA team. Typical topics for collection include mission details, personnel and manning, operations, unique equipment, facility security, and constructing possible attack scenarios that could severely damage or destroy the operational capability of the organization or Installation. The data collected may not be absolutely accurate, but it provides a good representation of what an external observer may be able to gather. Due to the limited surveillance time, the SO will make assumptions, take some liberties, and begin his/her duties in the advance surveillance phases as depicted below. Additionally, the SO Specialist uses a variety of collection techniques to assemble a composite picture of the target facility or intelligence packet. This composite picture represents how the facility or organization appears to outside observers. This viewpoint is particularly useful when addressing exploitable vulnerabilities, potential attack paths and mechanisms, and signature control. Unlike other BSA team members, the SO specialist collects data without the benefit of \"host facility\" providers or the acknowledged presence of the BSA team. Lastly, the SO Specialist dentifies potential targets and provides a rationale for their selection. Identifies routes and methods of attack for each selected target. Required Skills/Qualifications:10 years experience in DoD Special Forces (US Navy SEAL, US Army Special Forces, US Army Ranger, or Marine Corps Special Forces).Expert in identifying and targeting mission critical systems to include:  critical telecommunications systems and supporting infrastructure; IT networks; operational command and control platform both ground and air based; mission critical utilities systems; and security systems.Expert in the planning and executing of attack scenarios designed to destroy or severely degrade the above mentioned mission critical systems.Expert understanding of the tools essential in carrying out undetected surveillance operations.Expert in current methods of conducting undetected surveillance and counter-surveillance detection tactics, techniques and procedures.Must have an Active Top Secret Clearance with SCI Eligibility.Must be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/89672000521282246", "link": "https://jobs.parsons.com/job/13955058/physical-security-ps-specialist-fort-belvoir-va/", "job_info": "Minimum Clearance Required to Start:Top Secret SCIJob Description:Parsons Corporation is seeking candidates to join a highly successful team that has won and performed over $100 Million of Defense Threat Reduction Agency (DTRA) work around the world for more than 20 years.  This challenging and exciting work will provide you the opportunity to travel CONUS and OCONUS to the most important DoD defense systems and critical infrastructure to ensure the survivability of any threat or attack. This is an exciting opportunity to experience travelling to destinations around the world and protecting mission critical infrastructure.The Defense Threat Reduction Agency (DTRA), Nuclear Enterprise Support Directorate (NE) performs integrated, multidisciplinary, Balanced Survivability Assessments (BSAs) that assess survivability of critical U.S. and allied national/theater mission systems, networks, architectures, infrastructures, and assets.BSA teams aim to ensure continuity to DoD missions and critical infrastructure by assessing the vulnerabilities and survivability of these infrastructure against a broad spectrum of threats including accidents, natural disasters, technological failure, information system attacks, terrorists, radio frequency weapons (RFW), sabotage, and weapons of mass destruction (WMD).In order to ensure continuity of DoD Missions and to maintain continuous operations of critical infrastructure, it is imperative to have fully functional BSA teams (1) to conduct Blue Team Assessments; (2) to provide specific SME assistance to Technical Support Projects (TSPs); (3) to provide Design Review assistance; and (4) to provide technical assistance to the Home Team.   The size and skillsets of each team will vary and include those required to execute each mission.  The resource needs of each mission and/or stakeholder requests will be identified and managed by DTRA.BSA assessments include, but are not limited to, examining surveillance operations, physical security, telecommunications (e.g., video, voice and data, commercial and military), information operations (e.g., computer networks, IA tools use, operations security), structural protection and response (to include blast effects modeling and consideration of anti-terrorism/force protection standards), utility subsystems (e.g., power and heating, ventilation, and air conditioning reliability and endurance), weapons of mass destruction protection, emergency operations (e.g., emergency preparedness, fire protection, emergency response, disaster control and recovery, continuity of operations), and electromagnetic protection (e.g., electromagnetic pulse and radio frequency weapon susceptibility, lightning protection).  The BSA mission, by necessity, is fluid and requires the teams operating within these environments to be adaptable.BSA teams may be deployed to high-threat, but permissive environments anywhere in the world.The PS Specialist identifies physical security vulnerabilities and provide recommendations to enhance the overall mission protection by preventing or mitigating damage to or destruction of mission-critical systems should a plausible threat be carried out. The overall physical security posture, security management, contingency planning, overall security awareness, physical security systems designed to deny and delay, protective barriers, lock and key systems, access control procedures, electronic security systems designed to detect and assess intrusion, and response force capabilities are all examined for possible weaknesses and deficiencies. The physical security report is laid out in a manner that characterizes the designed physical security environment that supports physical security protection from both an insider and external threats. Additionally, the PS Specialist identifies all aspects of physical security-related vulnerabilities, increase the customer’s awareness of potential vulnerabilities and impacts on mission execution capability, and provide recommendations to mitigate or eliminate identified vulnerabilities. . Required Skills/Qualifications:Expert knowledge of the security needs for a wide-variety of mission critical infrastructure to include network and data centers, telecommunications systems, airfields, nuclear weapons systems, forward operating bases, and the defense industrial base.Demonstrated experience with DoD Security Directives, including their development and implementation of Army, Navy, Marine Corps, Air Force and Joint DoD Security directives.Expert knowledge of all DoD force protection/antiterrorism programs and requirements.Expert knowledge of all aspects of security management, security operations, and security system analysis.Must have an Active Top Secret Clearance with SCI Eligibility.Must be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/143899914003194566", "link": "https://jobs.parsons.com/job/13955057/software-engineer-co-op-intern-colorado-springs-co/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Software Engineer Co-op/InternLet’s talk about what you’ll be doing:Candidate will perform engineering tasks to help ensure that developed products meet design specifications and are within total quality management limits and standards. Responsibilities will include but are not limited to helping implement engineering solutions, identifying engineering issues, assisting in completion of engineering tasking. The successful candidate will be a self-starter with a strong work ethic who can thrive in a fast-paced environment employing agile methodologies. Operates under close supervision. No travel is required.Location: Colorado Springs, COResponsibilitiesSolve challenging problems to meet customer needsCreate well-designed, testable, and efficient codeCollaborate with team membersParticipate in an Agile Development ProcessExpand your knowledge of Computer NetworkingAsk smart questions, take risks, and champion innovative ideasHere’s what we’re looking for:Required SkillsCritical thinker with the ability and desire to tackle challenging, open-ended problems.Familiar with Software Development Life Cycle process.Familiarity with Configuration Management tools (Git and/or Subversion)Familiarity with continuous integration and delivery.Enrolled in Bachelor of Science in Software Engineering, Computer Science, Computer Engineering, Computer Security, or a related fieldProficient in:Java 8TypescriptAngularHTMLCSSLinuxMust be a US citizenDesired SkillsStrong communication skills with the ability to operate in a dynamic fast-paced environmentDevelopment / Testing methodologiesDesire to learn a variety of tools and techniques to help engineer solutions to complex problems.Parsons is a leading technology firm driving the future of defense, intelligence, and critical infrastructure. By combining unique technologies with deep domain expertise across cybersecurity, missile defense, space, connected infrastructure, and smart cities, we're providing tomorrow's solutions today.Ready to join our team as an intern this summer?The anticipated annualized full time target compensation (median) for this position is: $54,080.00.Benefits for this position include: 401k."}, {"name": "projects/talent-cloud-jobs-prod/jobs/100843038659486406", "link": "https://jobs.parsons.com/job/13955056/threat-analytic-developer-columbia-md/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Are you ready to be part of a cutting-edge cybersecurity project that will make a huge impact on the security of DOD/Intel community?  If you’re interested in leveraging your scripting / development skills to create specialized IDS Zeek/Bro scripts to assist in cybersecurity vulnerability assessments of mission-critical government systems, then we have the ideal role for you to start your new career path at Parsons!  Parsons’ diversely skilled teams’ architect, develop and provide deployment support for on-premise and cloud-based Network Security Monitoring (NSM) solutions.  Those products require team members contributing multi-disciplinary strengths to the solutions. Responsibilities:Perform network analysis with Intrusion Detection Systems.Utilize Python to write scripts designed to enhance Intrusion Detection Systems.Write Bro/Zeek scripts.Utilize Bash and/or Python scripting to automate system processes.Configure and support Linux CentOS systems to include passive and active sensors.Understand and prioritize development activities based on threat intelligence reports.Analyze system logs and identify potential issues.Develop, maintain, and contribute to a knowledge repository.Answer technical queries and assist developers and end users.Deliver reports to the customer as required by the contract.Qualifications:Bachelor’s degree (in computer science, engineering, mathematics, or related discipline) and at least one (1) year of experience working in a Linux based environment and Python scripting.Clearable up to the TS/SCI w/ Poly level.Preferred:PCAP experience; being able to parse/examine raw packet captures in order to help define the analytic.Agile development – experience with CI/CD and/or Git."}, {"name": "projects/talent-cloud-jobs-prod/jobs/109841441821205190", "link": "https://jobs.parsons.com/job/13955055/threat-analytic-developer-columbia-md/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Are you ready to be part of a cutting-edge cybersecurity project that will make a huge impact on the security of DOD/Intel community?  If you’re interested in leveraging your scripting / development skills to create specialized IDS Zeek/Bro scripts to assist in cybersecurity vulnerability assessments of mission-critical government systems, then we have the ideal role for you to start your new career path at Parsons!  Parsons’ diversely skilled teams’ architect, develop and provide deployment support for on-premise and cloud-based Network Security Monitoring (NSM) solutions.  Those products require team members contributing multi-disciplinary strengths to the solutions. Responsibilities:Perform network analysis with Intrusion Detection Systems.Utilize Python to write scripts designed to enhance Intrusion Detection Systems.Write Bro/Zeek scripts.Utilize Bash and/or Python scripting to automate system processes.Configure and support Linux CentOS systems to include passive and active sensors.Understand and prioritize development activities based on threat intelligence reports.Analyze system logs and identify potential issues.Develop, maintain, and contribute to a knowledge repository.Answer technical queries and assist developers and end users.Deliver reports to the customer as required by the contract.Qualifications:Bachelor’s degree (in computer science, engineering, mathematics, or related discipline) and at least one (1) year of experience working in a Linux based environment and Python scripting.Clearable up to the TS/SCI w/ Poly level.Preferred:PCAP experience; being able to parse/examine raw packet captures in order to help define the analytic.Agile development – experience with CI/CD and/or Git."}, {"name": "projects/talent-cloud-jobs-prod/jobs/135680944326484678", "link": "https://jobs.parsons.com/job/13953288/emergency-protection-emp-specialist-fort-belvoir-va/", "job_info": "Minimum Clearance Required to Start:Top Secret SCIJob Description:Parsons Corporation is seeking candidates to join a highly successful team that has won and performed over $100 Million of Defense Threat Reduction Agency (DTRA) work around the world for more than 20 years.  This challenging and exciting work will provide you the opportunity to travel CONUS and OCONUS to the most important DoD defense systems and critical infrastructure to ensure the survivability of any threat or attack. This is an exciting opportunity to experience travelling to destinations around the world and protecting mission critical infrastructure.The Defense Threat Reduction Agency (DTRA), Nuclear Enterprise Support Directorate (NE) performs integrated, multidisciplinary, Balanced Survivability Assessments (BSAs) that assess survivability of critical U.S. and allied national/theater mission systems, networks, architectures, infrastructures, and assets.BSA teams aim to ensure continuity to DoD missions and critical infrastructure by assessing the vulnerabilities and survivability of these infrastructure against a broad spectrum of threats including accidents, natural disasters, technological failure, information system attacks, terrorists, radio frequency weapons (RFW), sabotage, and weapons of mass destruction (WMD).In order to ensure continuity of DoD Missions and to maintain continuous operations of critical infrastructure, it is imperative to have fully functional BSA teams (1) to conduct Blue Team Assessments; (2) to provide specific SME assistance to Technical Support Projects (TSPs); (3) to provide Design Review assistance; and (4) to provide technical assistance to the Home Team.   The size and skillsets of each team will vary and include those required to execute each mission.  The resource needs of each mission and/or stakeholder requests will be identified and managed by DTRA.BSA assessments include, but are not limited to, examining surveillance operations, physical security, telecommunications (e.g., video, voice and data, commercial and military), information operations (e.g., computer networks, IA tools use, operations security), structural protection and response (to include blast effects modeling and consideration of anti-terrorism/force protection standards), utility subsystems (e.g., power and heating, ventilation, and air conditioning reliability and endurance), weapons of mass destruction protection, emergency operations (e.g., emergency preparedness, fire protection, emergency response, disaster control and recovery, continuity of operations), and electromagnetic protection (e.g., electromagnetic pulse and radio frequency weapon susceptibility, lightning protection).  The BSA mission, by necessity, is fluid and requires the teams operating within these environments to be adaptable.BSA teams may be deployed to high-threat, but permissive environments anywhere in the world.The EMP Specialist’s responsibilities include identifying and assessing protections that apply across all segments of site operations during all phases of peace and war, and covers a broad radio frequency (RF) spectrum. A RF threat could be directed to affect human or automated information-based processes, either friendly or adversarial, through any of the following EM pathways: electrical power systems, building, lighting, and equipment grounding to include tempest accreditation; adequately secured and non-secured communications systems; computer-based information systems. . Additionally, the EMP Specialist identifies all aspects of EM-related vulnerabilities, increases the customer’s awareness of potential vulnerabilities and impacts of EM on mission execution capability, and provide recommendations to mitigate or eliminate identified vulnerabilities. Performs EMP verification of onsite steel room construction IAW MIL STD 188-125-1. Required Skills/Qualifications:Master of Science degree in Physics; or related field of study with demonstrable emphasis (academic or experience) in Electromagnetic Theory. Expert in EM protection as it applies across a broad radio frequency (RF) spectrum from threats from external or internal sources that could potentially affect human or automated information- based processes.Must have an Active Top Secret Clearance with SCI Eligibility.Must be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/117666545817002694", "link": "https://jobs.parsons.com/job/13953287/senior-information-operation-io-specialist-fort-belvoir-va/", "job_info": "Minimum Clearance Required to Start:Top Secret SCIJob Description:Parsons Corporation is seeking candidates to join a highly successful team that has won and performed over $100 Million of Defense Threat Reduction Agency (DTRA) work around the world for more than 20 years.  This challenging and exciting work will provide you the opportunity to travel CONUS and OCONUS to the most important DoD defense systems and critical infrastructure to ensure the survivability of any threat or attack. This is an exciting opportunity to experience travelling to destinations around the world and protecting mission critical infrastructure.The Defense Threat Reduction Agency (DTRA), Nuclear Enterprise Support Directorate (NE) performs integrated, multidisciplinary, Balanced Survivability Assessments (BSAs) that assess survivability of critical U.S. and allied national/theater mission systems, networks, architectures, infrastructures, and assets.BSA teams aim to ensure continuity to DoD missions and critical infrastructure by assessing the vulnerabilities and survivability of these infrastructure against a broad spectrum of threats including accidents, natural disasters, technological failure, information system attacks, terrorists, radio frequency weapons (RFW), sabotage, and weapons of mass destruction (WMD).In order to ensure continuity of DoD Missions and to maintain continuous operations of critical infrastructure, it is imperative to have fully functional BSA teams (1) to conduct Blue Team Assessments; (2) to provide specific SME assistance to Technical Support Projects (TSPs); (3) to provide Design Review assistance; and (4) to provide technical assistance to the Home Team.   The size and skillsets of each team will vary and include those required to execute each mission.  The resource needs of each mission and/or stakeholder requests will be identified and managed by DTRA.BSA assessments include, but are not limited to, examining surveillance operations, physical security, telecommunications (e.g., video, voice and data, commercial and military), information operations (e.g., computer networks, IA tools use, operations security), structural protection and response (to include blast effects modeling and consideration of anti-terrorism/force protection standards), utility subsystems (e.g., power and heating, ventilation, and air conditioning reliability and endurance), weapons of mass destruction protection, emergency operations (e.g., emergency preparedness, fire protection, emergency response, disaster control and recovery, continuity of operations), and electromagnetic protection (e.g., electromagnetic pulse and radio frequency weapon susceptibility, lightning protection).  The BSA mission, by necessity, is fluid and requires the teams operating within these environments to be adaptable.BSA teams may be deployed to high-threat, but permissive environments anywhere in the world.The IO Specialist’s responsibilities include reviewing and assessing all cyber issues and integration employment of the core capabilities of electronic warfare (EW), computer network operations (CNO), and military deception and operations security (OPSEC) in concert with specified supporting and related capabilities to influence, disrupt, corrupt, or usurp adversarial human and automated decision-making while protecting our own. Additionally, the IO Specialist  must provide operational IO-related vulnerability mission impacts and remediation inputs to the BSA team.Required Skills/Qualifications:Possess IO and Cyberspace Operations (CS) experience and have completed the courses that would satisfy the requirements for DoD IAT Level II and CSSP Auditor certifications as defined and described in Joint Publications 3-13 Information Operations and 3-12 Cyberspace Operations, DoDI 8500.1, DoD 8570.01 and 8570.01-M. At a minimum, to satisfy the DoD IAT Level II and CSSP Auditor certifications. Possess working knowledge of DoD’s IT system and network certification and accreditation processes to include system security authorization agreements.Bachelor of Science in computer networks and cybersecurity. In lieu of a degree, commensurate operational experience may be substituted.Mastery level experience working hands-on with Computer Network modeling and network diagraming software.Mastery level experience working hands-on with Computer Network vulnerability/compliance analysis software.Must have an Active Top Secret Clearance with SCI Eligibility.Must be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/122362353820803782", "link": "https://jobs.parsons.com/job/13953286/emergency-operations-eo-specialist-fort-belvoir-va/", "job_info": "Minimum Clearance Required to Start:Top Secret SCIJob Description:Parsons Corporation is seeking candidates to join a highly successful team that has won and performed over $100 Million of Defense Threat Reduction Agency (DTRA) work around the world for more than 20 years.  This challenging and exciting work will provide you the opportunity to travel CONUS and OCONUS to the most important DoD defense systems and critical infrastructure to ensure the survivability of any threat or attack. This is an exciting opportunity to experience travelling to destinations around the world and protecting mission critical infrastructure.The Defense Threat Reduction Agency (DTRA), Nuclear Enterprise Support Directorate (NE) performs integrated, multidisciplinary, Balanced Survivability Assessments (BSAs) that assess survivability of critical U.S. and allied national/theater mission systems, networks, architectures, infrastructures, and assets.BSA teams aim to ensure continuity to DoD missions and critical infrastructure by assessing the vulnerabilities and survivability of these infrastructure against a broad spectrum of threats including accidents, natural disasters, technological failure, information system attacks, terrorists, radio frequency weapons (RFW), sabotage, and weapons of mass destruction (WMD).In order to ensure continuity of DoD Missions and to maintain continuous operations of critical infrastructure, it is imperative to have fully functional BSA teams (1) to conduct Blue Team Assessments; (2) to provide specific SME assistance to Technical Support Projects (TSPs); (3) to provide Design Review assistance; and (4) to provide technical assistance to the Home Team.   The size and skillsets of each team will vary and include those required to execute each mission.  The resource needs of each mission and/or stakeholder requests will be identified and managed by DTRA.BSA assessments include, but are not limited to, examining surveillance operations, physical security, telecommunications (e.g., video, voice and data, commercial and military), information operations (e.g., computer networks, IA tools use, operations security), structural protection and response (to include blast effects modeling and consideration of anti-terrorism/force protection standards), utility subsystems (e.g., power and heating, ventilation, and air conditioning reliability and endurance), weapons of mass destruction protection, emergency operations (e.g., emergency preparedness, fire protection, emergency response, disaster control and recovery, continuity of operations), and electromagnetic protection (e.g., electromagnetic pulse and radio frequency weapon susceptibility, lightning protection).  The BSA mission, by necessity, is fluid and requires the teams operating within these environments to be adaptable.BSA teams may be deployed to high-threat, but permissive environments anywhere in the world.The EO Specialist’s responsibilities include understanding policies, plans, procedures, training, equipment, organization, and response management to a wide variety of emergencies including natural disasters, technological and human accidents (to include fire), and hostile incidents. The EO Specialist identifies all aspects of EO-related vulnerabilities, increases the customer’s awareness of potential vulnerabilities and impacts on mission execution capability, and provides recommendations to mitigate or eliminate identified vulnerabilities. Additionally, the EO Specialist recommends methods to reduce vulnerabilities and improve response capabilities, and evaluates the site/facility continuity of operations planning (COOP) capability to prepare for, respond to, and recover from, various mission-threatening emergencies.Required Skills/Qualifications:Extensive knowledge and understanding of applicable National Fire and Protection Association NFPA, DoDI, 29 CFR and UFC Standards and best practices.Professional certification in: emergency management; or fire protection; or business continuity. Additionally, possess training or experience in any area not formally certified.Must have an Active Top Secret Clearance with SCI Eligibility.Must be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/97277202191524550", "link": "https://jobs.parsons.com/job/13953285/engineer-senior-supervising-instrumentation-control-aiken-sc/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Ready to lead a team that tackles infrastructure challenges? Want to take your Engineering expertise to the next level to work on complex electrical engineering problems that will make a huge impact on the community? Parsons is now hiring an experienced Senior Supervising Electrical Engineer who can apply advanced engineering techniques and supervise a team of Engineers and Designers.   Parsons extensive experience in this field, combined with your engineering knowledge, will propel your career forward with opportunity for advancement with top performance. Leadership opportunities to work on marquee projects as you and our fastpaced business grow and evolve. We need our engineers to be versatile, enthusiastic to work in highly flexible, team oriented environment and who have exceptional communication, analytical and management skills. In this role you will supervise a group of ten or more Engineers and design personnel, in one discipline or multiple disciplines, by directing technical engineering assignments and coordinating project staffing assignments.  Willingness to travel or relocate to supplier client or constructions site locations is expected.  Responsibilities:  Reviews work produced to ensure that applicable codes, standards, and procedures are followed and quality is acceptable. Monitors productivity and technical proficiency of assigned personnel.  Makes staffing assignments and reassignments as project needs arise.Conducts performance evaluations, takes corrective action as necessary, recommends promotions and salary actions, and recommends training and development for assigned personnel.Helps to define discipline design organization and participation on a project, including scope of work, design criteria, schedules, standards, a nd procedures.Determines budget estimates and staffing requirements for the defined scope and schedule.Supervises the production of project drawings and design calculations.Promotes technical excellence on the project, including furthering the Quality Improvement Process.Ensures that discipline design work is coordinated with project staff and Engineers from other disciplines by maintaining clear and frequent communications.Advises engineering and project management regarding any problem areas, staffing requirements, delays in production, scope changes, or other events which could effect project completion and/or profitability.Initiates and/or reviews change order requests for additions, deletions, or changes to the original scope of work.Ensures that adequate checking is performed in accordance with discipline checking policy and procedures.Recommends design methods, equipment use, etc., for discipline standards.Maintains affiliation with professional societies to keep abreast of current technologies.Recommends and prepares technical papers.Performs other responsibilities associated with this position as may be appropriate.  Qualifications:Bachelor's degree in Engineering (or related field)15+ years of related work experienceProfessional Engineer registration may be requiredProven ability to perform in a supervisory capacityExcellent written and oral communications skillsThorough knowledge of industry practices and regulations are required Must also possess a thorough knowledge of current technology and be able to select and apply appropriate engineering software for use on project"}, {"name": "projects/talent-cloud-jobs-prod/jobs/95753266190525126", "link": "https://jobs.parsons.com/job/13949547/cyber-software-developer-va-or-co-centreville-va/", "job_info": "Minimum Clearance Required to Start:Top SecretJob Description:PARSONS is looking for a Software Developer who has experience leading teams that work in the exciting cyber domain. In this role you will use your full-stack experience to coach your team on how to write clear, concise, functioning and fully commented code that turns our Defensive Cyber Operations (DCO) customer’s requirements for cloud-based applications into reality. Your team will be focused on developing and improving a data ingest and parsing application used by the customer to get network data injected and usable by other network mapping applications.You will get to partner and support today’s warfighter:Convert customer requirements, including informal requirements, into total systems solutions that fit within the technical, schedule, and cost constraints of the programOperate in an agile development environment using DevSecOps practicesCollaborate with program management and other technical staff to plan sprintsConduct and participate in design reviews, sprint demonstrations, and after-action reviewsDevelop scalable web-based data visualization and analytic platforms using Java, JavaScript (TypeScript), React, scalable databases (Hadoop, Elasticsearch, PostgreSQL), Docker, PythonRequired QualificationsUS Citizenship with the ability to obtain a Top Secret ClearanceB.S. in Software Engineering, Computer Engineering, Computer Science, or a related discipline. (A combination of education and demonstrable experience will be considered in lieu of a degree.)5+ years professional development experienceExperience developing in a Linux environment (RHEL, CentOS, Ubuntu)Knowledge of networking concepts including the OSIAgile project management with Jira and ConfluenceExperience with Git, Gitlab, Gitbucket, or BitbucketExperience with Node.js, React, HTML/CSS, JSON, Typescript, Java and PythonMentor and lead junior team membersGood verbal and written communication skillsDesired QualificationsActive Top Secret security clearanceExperience with: Scala, Jest, XML, YAML, Elasticsearch, SQL, MySQL, or SQLiteNetworkingDeployment experience with Ansible and/or DockerUI/UX experience#WeAreParsons #CreateYourFuture The anticipated annualized full time target compensation (median) for this position is: $185,000.00.Benefits for this position include: medical, dental, vision, paid time off and 401K.Must be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/110143674374857414", "link": "https://jobs.parsons.com/job/13818963/defensive-cyberspace-operator-associate-colorado-springs-co/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Defensive Cyberspace Operator, AssociateJob Code: R121390Location: Colorado Springs, Colorado, United StatesReady for a challenge that will keep you on the edge of cyber security? Want to take your technical experience to the next level and work alongside other backend ninjas to protect privacy and ensure security for our national defense systems? Parsons is now hiring Defensive Cyberspace Operators with a passion for cyber security.  Parsons extensive experience in this field, combined with your technical knowledge, will propel your career forward with opportunity for advancement with top performance. Training, development and opportunities to switch teams and projects as you and our fast paced business grow and evolve. We need our Operators to be versatile, display leadership qualities and be enthusiastic to tackle new challenges across the full stack as we continue to push security forward. Our Defensive Cyberspace Operators have the opportunity to design, develop, and implement leading-edge analytical and technical methodologies, tools, and policies/standards to ensure a cyber-secure environment for customer organizations. Such security measures include intrusion detection and prevention, software and system security protection through application of secure design protocols and reverse engineering, and data assurance. POSITION OVERVIEW:Designs, develops, and implements leading-edge analytical and technical methodologies, tools, and policies/standards to ensure a cyber-secure environment for customer organizations. Such security measures include intrusion detection and prevention, software and system security protection through application of secure design protocols and reverse engineering, and data assurance.This position requires shift work: 3PM - 11PM, Monday-Friday.QUALIFICATIONS:Technical school + with emphasis on cyberspace security and defense. Bachelor degree not required.DoD 8570 certification (IAT II minimum): CCNA Security, CySA+ **, GICSP, GSEC, CompTIA Security+ CE (Sec+), CND, SSCP. Familiarity with Security Information and Event Management tools and threat hunting including LogRhythm and Splunk.Must be able to obtain and maintain a security clearance. No security clearance is required to start.Anticipated compensation (median) for this position: $95,000 annually. However, Parsons Government Services - Space & Geospatial Solutions considers several factors when extending an offer, including but not limited to, the role and associated responsibilities, a candidate's work experience, clearance level, education/training, and key skills.Benefits for this position include: medical, dental, vision, paid time off, 401k. #CJWe harness the power of innovation so that you can change the world and help our customers solve their most complex challengesThe anticipated annualized full time target compensation (median) for this position is: $95,000.00.Benefits for this position include: medical, dental, vision, paid time off, Employee Stock Ownership Plan (ESOP) and 401K."}, {"name": "projects/talent-cloud-jobs-prod/jobs/88099625879118534", "link": "https://jobs.parsons.com/job/13945441/graphic-designer-telecommute-remote/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Graphic Designer (Telecommute)Target Market: Chicago, ILAre you a creative graphic designer that gravitates toward engineering, environmental, construction or architecture related projects? Parsons is seeking a Graphic Designer who has interest in designing and preparing moderately complex art and copy layouts utilizing client standards and formats. When we collaborate, we all succeedGroup effort wins championships here. Motivated team members pitch in, thinking and working together to solve problems and reach goals. You’ll be valued as an important part of your team’s success. The diversity of our staff creates a varied and vibrant community that makes so much success possible. We welcome, include, and look to promote all.Responsibilities:You may work directly with the client and our technical team to review artwork, text, and other materials submitted for inclusion in assigned documents. You will design and produce reproduction ready and internet formatted graphics that may include project updates, newsletters, brochures, meeting notifications, presentations, charts, tables, sketches, posters and signs.Ability to convey purpose and intent of infrastructure concepts via graphic representation, as well as a professional and respectful demeanor will be keys to your success.Qualifications:Associate's or equivalent degree in Graphic Design or certificate of completion from an accredited design/graphics course (or equivalent) is preferred3+ years of related work experienceProven ability to visually depict accurate information and project concepts when developing graphics and creating presentationsTechnical competent in software such as Adobe CS4, Photoshop, Illustrator, InDesign, Dreamweaver, Acrobat, Aftereffects and MicrosoftFamiliarity and interest in engineering, environmental, construction or architecture projects Find out how good it feels to work in a supportive environmentThe people who work at our organization have pep in their step when they come to work — some even before they’ve had their coffee! Morale is high. How could it be otherwise when people cooperate and come together to win. Management leads by example, recognizing and rewarding your best efforts. It’s easy to succeed when you enjoy your work, and when your workplace is glad to have you.Parsons (NYSE: PSN) is a leading technology firm driving the future of defense, intelligence, and critical infrastructure. By combining unique technologies with deep domain expertise across cybersecurity, missile defense, space, connected infrastructure, and smart cities, we're providing tomorrow's solutions today. With a history of disruption beginning in 1944, we apply our distinct perspective to help our customers confront the issues of tomorrow in every domain—land, sea, air, space, and cyber. Our range of capabilities and our global network of resources lets us layer and integrate solutions to respond to any challenge with unmatched agility. In a time of rapid change, we see infinite sources of inspiration to fuel our creativity and enable the innovation necessary to accomplish our quest of delivering a better world.  For more about Parsons, visit us at parsons.com and follow our quest on Facebook, Instagram, Twitter, and LinkedIn. Benefits for this position include: medical, dental, vision, paid time off, Employee Stock Ownership Plan (ESOP) and 401K."}, {"name": "projects/talent-cloud-jobs-prod/jobs/106856194737349318", "link": "https://jobs.parsons.com/job/13945440/information-systems-security-officer-level-1-chantilly-va/", "job_info": "Minimum Clearance Required to Start:Top Secret SCI w/PolygraphJob Description:Parsons Federal Intelligence seeks to hire Information Systems Security Officers to provide comprehensive information system security support to an Intel Community customer. The ISSOs will be responsible for malicious code eradication, configuration management, assessment and authorization of current and future systems.  ISSOs must have a working knowledge of system functions, security policies, technical security safeguards, and operational security measures.Required Qualifications:Active Top Secret/SCI Security clearance with PolygraphAssociates Degree or High School Diploma/GED and 4 years of related experience Desired Qualifications:  Experience in technical project managementFamiliarity with conducting research and analysis, network and information system security principles and best practices, and controlling, labeling, virus scanning, and transferring data between information systems at varying classification levelsAbility to establish rapport with military, civilians, and contractors while prioritizing tasks to suit mission requirementsKnowledge of applicable IC and DoD policies, procedures and operating instructions related to Information Technology, Information Assurance, and Information Management#CJClearance Requirement: TS/SCI w/ PolygraphMust be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/109235864317371078", "link": "https://jobs.parsons.com/job/13943614/cyber-security-analyst-huntsville-al/", "job_info": "Minimum Clearance Required to Start:Secret\r\n\r\nJob Description:\r\nParsons is seeking a Cyber Security Analyst to support the Missile Defense Agency Ground Based Midcourse Defense Program Office. Candidate should be able to manage the system level processes in the eMASS tool to obtain and preserve an Authorization-To-Operate (ATO). Manage and execute the system’ priorities to ensure that artifacts are well-documented within eMASS at all times. Additionally, the candidate will be responsible for providing expertise for Cybersecurity Monitoring Services (ACAS) in support of Risk Management Framework (RMF). Responsibilities:Ability to identify and brief technical concerns through executive level- briefings to senior leadershipAssist with Risk Management (RM), to include developing, implementing, and monitoring RM processes and procedures; analyzing performance; and assessing issues.Ability to coordinate with multiple stakeholders to execute system requirementsAnalyze policies and procedures against Federal laws and regulations and provide recommendations for closing security gapsAssist with risk handling plans and make recommendations for technical engineering solutions to cybersecurity compliance issues.Support the Government Integrated Product Team by representing the interests of the Customer in working group forums, Technical Interchange Meetings (TIMs), and any other forums required by the customer.Research, analyze, and document the applicability and feasibility of Cyber technology/upgrades and their Cyber/Computer Network Defense impacts in support of the Weapon and/or Missile Systems.Assist the Program in developing artifacts to support authorization activities.Assist in guiding all packages through the eMASS Package Approval Chain (PAC) and ensure required technical representation is present for any signing session with the AO.Ensure that all artifacts and Objective Evidence in the eMASS tool meet the requirements for the PAC for systems that are ready to receive a system authorization or approval.Identify, define and characterize development-related cyber and technical risks, provide the evidence-based rationale for this and recommend mitigation for informed management decisions.Monitor and evaluate engineering architectural diagrams and develop and maintain the GM Architecture Documents for future capabilities.Experience Requirements:7+ years of related experience with DoD systems; preferably with GMD or MDA programs from a Prime development level or service support level effortBS degree (B.S Engineering, Science, or Mathematics desired. Will consider Information Systems or Cybersecurity)Candidate must have a Secret Clearance, prefer Top SecretExperience with Risk Management Framework implementation throughout the acquisition lifecycle processComprehension of continuous monitoring to support for information systems.2+ years of experience with Risk Management Framework (RMF) preferredProficiency in written and verbal skills as well as MS OfficeDemonstrated ability to deliver products on scheduleCapability to develop and present program briefings to senior management-level personnelAbility to interpret raw data and develop metrics for briefingsFamiliarity and experience with engineering programs desired.Capable of performing as a member of a team and assisting with solving complex problemsProficient in Microsoft Word, Excel, and PowerPointSelf-starter with enthusiasm and capacity to learn in a fast-paced environmentTravel as required to support oversight, meetings, reviews, etc. Attributes:• Honesty, superior ethics• Interpersonal savvy, excellent communication skills• Ability to be a team player• Initiative• Positive attitude• ProfessionalismMust be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/138104641616257734", "link": "https://jobs.parsons.com/job/13943613/sr-scheduler-annapolis-junction-md/", "job_info": "Minimum Clearance Required to Start:Top Secret SCI w/PolygraphJob Description:Ready to be part of a team that tackles defense and data challenges? Want to take your Scheduling skills to the next level to work on tough projects that will make a huge impact? Parsons is now hiring experienced Schedulers with a desire to work on projects that change the urban fabric of our community.Parsons’ extensive experience in this field, combined with your scheduling knowledge, will propel your career forward with opportunity for advancement with top performance. We offer training, development and opportunities to work on marquee projects as you and our fast-paced business grow and evolve. We need our schedulers to be versatile, enthusiastic to work in highly flexible, team-oriented environments and who have exceptional communication, analytical and organizational skills.PROJECT:Parsons provides a Technical Services program to a Department of Defense agency with responsibilities to review third party A/E work; conduct studies, analysis, testing and measuring; perform specialized engineering services, planning and design reviews; commissioning services; and construction oversight on worldwide delivery orders.RESPONSIBLITIES:Parsons is seeking a Scheduler to perform the following:•             Support the development of enterprise-level schedule reporting and analysis.  This support may include the development of standard formats, structure, and reporting components as well as subsequent data entry/validation.Performs special analysis for schedules established with Primavera Software P6; analyzes progress reports against the scheduleAssess the impact of design/construction changes and schedule slippages and provide recommendations to the clients’ Program Manager(s).Recommend metrics for reporting the schedule and cost performance for projects.Assist in the development of business process improvements related to scheduling, estimating, and project controls.Recommend and oversee the customization of project control systems to meet specific project requirementsAssist with the development of the Work Breakdown Structure (WBS) applied at the project level.•             Prepares plans and schedules, status reports and performance evaluations.•             Maintains liaison with the project team for schedule revision and update.•             Supports Program Controls Manager and Scheduling Manager in accomplishing project status review and performance control.•             This is a full-time position, based in Annapolis Junction, MD.QUALIFICATIONS:Bachelor's degree (B.S./B.A.)5 years or more of applicable scheduling experienceExperience with MicroSoft Project and Primavera P6.8, as well as Government Archibus and Blueprinter systems.Applicants selected for employment will be subject to a federal background investigation and must meet additional eligibility requirements for access to classified information or materials.Must be a US Citizen.Must have TS/SCI w/Polygraph clearance.SKILLS/COMPETENCIES:•             Experienced with all aspects of scheduling.Working knowledge of word processing and integrated software applications, including Project Controls Software and MicroSoft Office Suite.Must be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/124229079751631558", "link": "https://jobs.parsons.com/job/13943612/facilities-assessor-annapolis-junction-md/", "job_info": "Minimum Clearance Required to Start:Top Secret SCI w/PolygraphJob Description:Do you enjoy assessing facilities?  Enjoy traveling to different locations? Parsons provides program and facilities assessment support to a DOD client worldwide. We are seeking a Senior Facilities Assessor to evaluate and monitor field assessment data, assist in developing cost estimates, and support our global facilities assessment work.  Keys to your success will be your previous experience in conducting facilities assessments; as well as your knowledge of cost estimating.   Work as part of a team performing facility evaluations by applying architectural and/or engineering standards, practices, and techniques. The Facility Assessor at this level regularly exercises his/her familiarity of company and project practices and procedures, and is experienced in project mobilization, setup and orientation procedures. The incumbent is viewed as a fully qualified professional with solid experience and technical expertise in performing the duties of either an architectural/civil facility condition assessment assessor or a mechanical, electrical and plumbing assessor. Assessors are responsible for visually evaluating the architectural/MEP building systems, gathering data, and noting any deficient conditions.Qualifications:Bachelor’s degree in Architecture, Engineering or Construction Management (or related field); non-degreed Assessors must have 12+ years of relevant work experience8+ years of related experienceProficiency in the application of engineering and architectural design standards, practices, and techniqueProficient in Microsoft Office SuiteRequires a working knowledge of commercial construction codes and their application to existing facilitiesStrong written and oral communication skillsAbility to walk for long periods (6 to 8 hours/day) and climb laddersU.S. CitizenshipACTIVE TS/SCI w/ POLYGRAPH CLEARANCE REQUIREDMust be able to obtain, maintain and/or currently possess a security clearance."}, {"name": "projects/talent-cloud-jobs-prod/jobs/124241999013257926", "link": "https://jobs.parsons.com/job/13943611/environmental-scientist-geologist-breckenridge-mi/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Are you an engineer, geologist, scientist with a passion for environmental sustainability? Parsons could be the right fit for you!Parsons is seeking candidates with a background in Environmental Geology and Science. In this role you will be investigating, mapping and mitigating environmental concerns such as contaminated soil; abandoned oil wells, abandoned oilfield pipeline systems, abandoned underground storage tanks (USTs), asbestos flowline, underground injection wells; coordinating wetland and floodplain management requirements and general environmental restoration program activities. You will be involved in reviewing the data and contributing to the preparation of various environmental reports that are submitted to the client and regulatory agencies. You will be actively engaged in supporting the construction teams in minimizing impact of soil contamination or construction activities (dust control, construction water disposal, etc.). The key to your success will be your ability to help our client execute mitigation strategies in a fiscally responsible manner to assure compliance with local, state and federal regulations, schedule performance, and community safety.Qualifications:Bachelor's degree in Environmental Engineering, Geology or Environmental SciencesRelated work experience preferred2+ years of experienceCompletion of a 40-hour OSHA training course (with an annual 8-hour update) a plus"}, {"name": "projects/talent-cloud-jobs-prod/jobs/81391831855571654", "link": "https://jobs.parsons.com/job/13712873/principal-structural-engineer-abu-dhabi-ae/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:Principal Structural EngineerAbu Dhabi, UAEYou take pride in the work you do, and it showsYou lead your team to approach a task with an enthusiasm to make it the best it can be — a reflection of your high standards. Your emphasis on timeliness and accuracy will be greatly valued. If it is not top-notch work, you will see that it’s corrected in your usual “we’ve got this handled” way.Ready to lead a structural team that will mainly design bridges and tunnels in addition to other structures for major projects? Want to take your Engineering expertise to the next level to work on challenging projects that will make an impact on the community? Parsons is looking for a Principal Structural Design Engineer who will lead a structure design team in the delivery of various major design projects for all our important clients. We hope that we can count on receiving your application.Major Activities PerformedSupervise and Lead a team of structural engineers to deliver large projects in compliance with each project requirement under the direct supervision of the Design Director.Lead the preparation of structural design drawings, specifications, and calculation submittals for a range of structural design projects in accordance with all relevant standards.Ensure professional speedy and courteous responses to all structural related enquiries from Clients and Authorities.Lead the preparation of the technical correspondence, reports, and studies for structural related works.Responsible technically of the engineering production of the structure team.Coordinate with Geotechnical Specialist for issues related to soil-structure interaction.Coordinate structural engineering activities with other disciplines within the Engineering Departments.Interface with the Client and approval Agencies/Authorities for Bridge, Tunnel and other Structural Design Works.Provide technical advice to other engineering departments with respect to Bridges, Tunnels and other Structures.Provide technical assistance during pre-bid conferences, proposal evaluations, and post-award or other contract conferences.Act as a mentor for the structural project team.   Evaluate the personal performance of the structural staff against their respective Specific Accountabilities.Perform other duties as directed by the Design Director.Experience and QualificationsBachelor's degree in Civil Engineering and/or Structural Engineering with twenty (20) years minimum post-graduate professional experience in structural engineering design and construction with a strong emphasis in the design and construction of precast and cast-in-place concrete bridges and tunnels including segmental bridges. Experience in design and construction of steel bridges will be plus.Advance degree such as a Master’s degree in Structural Engineering from a reputable recognized university is preferred.US registration as a Professional Engineer or equivalent is a plus.Demonstrated project management experience to deliver multiple projects that meet strict deadlines, budgets and deliver identified outcomes.Experience in applying relevant local and international industry standards in relation to Structural engineering design.Must be fully conversant with AASHTO LRFD, American Concrete Institute (ACI) and Steel Construction Manual of American Institute of Steel Construction (AISC) codes and standards.Demonstrated experience investigating, analyzing and resolving difficult design problems.Ability to work independently on a diverse range of design projects.Demonstrated ability to effectively plan the use of resources to meet the requirements of the organization.Demonstrated ability to manage a number of conflicting priorities simultaneously.High level excellent English communication skills (written & oral) with demonstrated ability to produce professional accurate, concise and timely reports and high quality presentations on relevant matters.Must be dependable and self-motivated leader."}, {"name": "projects/talent-cloud-jobs-prod/jobs/105995947147698886", "link": "https://jobs.parsons.com/job/13939067/part-time-design-quality-engineer-fort-worth-tx/", "job_info": "Minimum Clearance Required to Start:Not Applicable/NoneJob Description:T4 Program Summary: The Federal Aviation Administration (FAA) awarded the Technical Support Services Contract 4 (T4) to Parsons as the prime contractor. This $1.3 billion+ contract has a 4-year base period with two 3-year options. The statement of work includes a variety of activities that support the FAA’s Capital Investment Plan (CIP) modernization efforts: Site selection and engineering, construction, environmental and fire/life safety, equipment installation and testing, CAD, and other technical services as required. Work is performed across the nation in each of the FAA’s nine regions as well as the Aeronautical Center in Oklahoma City, Oklahoma, and the Technical Center in Atlantic City, New Jersey and in several U.S. territories. An average staff of 400-500 with a peak staff over 650 supports this contract, in addition to those subcontractors who perform construction work.  Responsibilities:The successful candidate will be responsible for engineering quality control review of designs for compliance with Federal Aviation Administration (FAA) requirements, FAA standards, national codes, and constructability. In some cases, the candidate may be required to visit job construction sites during or after construction to identify deficiencies in construction or installation.Qualifications:1.   Must have either worked for a federal authority responsible for national airspace communications and/or control designs, or as a contractor with a track record of multiple successful establishments of FAA National Airspace Systems including, but not limited to, NAVIDs, Communications, Terminal, EnRoute, Beacons, runway approach light systems, VOR/DVOR/VORTAC, or ADSB.2.  Must be able to meet customer security requirements.  A background check by Federal Authorities will be performed.3. Bachelor's Degree in Engineering (or related field) and typically 8+ years of related work experience.4. Familiar with Microsoft Office, such as Excel, Word, Project, PowerPoint, Access, etc.5. Familiar with cloud-based databases, such as MS SharePoint.6. Experience using CAD software such as MicroStation or AutoCAD is desirable7. Must be able to meet customer security requirements.  A background check by Federal Authorities will be performed. 8. Must have experience working facility constructions, design and/or construction of national airspace communications for design"}]